### 14 - Outer Merge

In [1]:
import numpy as np
import pandas as pd

In [15]:
#dataframes
registrations = pd.DataFrame({'reg_id':[1,2,3,4],'name':['Andrew','Bobo','Claire','David']})
logins = pd.DataFrame({'log_id':[1,2,3,4],'name':['Xavier','Andrew','Yolanda','Bobo']})

In [16]:
registrations

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  Claire
3       4   David

In [17]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [18]:
#perform outer merge
pd.merge(logins,registrations, how='outer', on='name')

   log_id     name  reg_id
0     1.0   Xavier     NaN
1     2.0   Andrew     1.0
2     3.0  Yolanda     NaN
3     4.0     Bobo     2.0
4     NaN   Claire     3.0
5     NaN    David     4.0

### Joining on Index instead of columns

In [19]:
#set name as index
registrations = registrations.set_index('name')

In [20]:
registrations

        reg_id
name
Andrew       1
Bobo         2
Claire       3
David        4

In [21]:
#merge on index
pd.merge(registrations, logins, left_index=True,right_on ='name', how='inner')

   reg_id  log_id    name
1       1       2  Andrew
3       2       4    Bobo

### Dealing with different column names

In [23]:
registrations  = registrations.reset_index()
registrations

     name  reg_id
0  Andrew       1
1    Bobo       2
2  Claire       3
3   David       4

In [24]:
#change the column names
registrations.columns = ['reg_name', 'reg_id']

In [25]:
registrations

  reg_name  reg_id
0   Andrew       1
1     Bobo       2
2   Claire       3
3    David       4

In [26]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [32]:
#merge again
results = pd.merge(registrations, logins, how='inner', left_on='reg_name', right_on='name')
results

  reg_name  reg_id  log_id    name
0   Andrew       1       2  Andrew
1     Bobo       2       4    Bobo

In [34]:
#drop duplicates
results.drop('reg_name', axis=1)

   reg_id  log_id    name
0       1       2  Andrew
1       2       4    Bobo